examples/flows/compiled/fanout_literal/flow.mmd
flowchart TD
    %% Flow: analysis_flow

    end_analysis_flow([end_analysis_flow])
    entity_recognizer[entity_recognizer]
    fanin_analysis_flow_line_14[fanin_analysis_flow_line_14]
    merge_analysis[merge_analysis]
    router_analysis_flow_line_14_fanout_1{{router_analysis_flow_line_14_fanout_1}}
    sentiment_analyzer[sentiment_analyzer]
    start_analysis_flow([start_analysis_flow])
    topic_extractor[topic_extractor]

    start_analysis_flow --> router_analysis_flow_line_14_fanout_1
    router_analysis_flow_line_14_fanout_1 -->|fanout| fanin_analysis_flow_line_14
    fanin_analysis_flow_line_14 --> merge_analysis
    router_analysis_flow_line_14_fanout_1 --> sentiment_analyzer
    sentiment_analyzer --> fanin_analysis_flow_line_14
    router_analysis_flow_line_14_fanout_1 --> topic_extractor
    topic_extractor --> fanin_analysis_flow_line_14
    router_analysis_flow_line_14_fanout_1 --> entity_recognizer
    entity_recognizer --> fanin_analysis_flow_line_14
    merge_analysis --> end_analysis_flow
